### Phase 2 - Cleaning the Data
### Steps
1. Check Total Records and bird's eye view observation
2. Check the duplicate records ( all rows)
5. Drop row base on the condition (if necessary otherwise you can skip this but be careful while deleting the entire row it might impact the accuracy of analysis)
3. Check duplicate values in each column 
4. Rename the columns names best suited for the nature of column
4. Check the Null / Empty cells
5. Finding Missing Values such as (NA,None,NaN,NoT)
3. Change the Column Data Type
5. Delete the unnecessary Columns

In [536]:
# import Pandas Library / Package
import pandas as pd

In [537]:
# we are using our own generated Real life fake data of restaurant to practice this phase
df = pd.read_csv('../Data-Analysis-Beginner/restaurant_customers_fake_data_copy.csv')

#### 1. Check Total Records and bird's eye view observation

In [538]:
# 1 Check all record using info method
# this function can help us find the total records, total columns, data type of each columns
df.info()
## PRIMARY ANALYSIS / OBSERVATION
    # 1. We have total of 500 records in the file
    # 2. Name,Email,Phone Number columns does not  have any empty cells
    # 3. Visit Date, Total Bill, Payment Method, Rating and Feedback columns have many empty cells, which is not a very good sign for the Data Analysis

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 8 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Name            10 non-null     object
 1   Email           10 non-null     object
 2   Phone Number    10 non-null     object
 3   Visit Date      7 non-null      object
 4   Total Bill      6 non-null      float64
 5   Payment Method  7 non-null      object
 6   Rating          9 non-null      float64
 7   Feedback        4 non-null      object
dtypes: float64(2), object(6)
memory usage: 772.0+ bytes

In [539]:
 # view data types
df.dtypes
## PRIMARY ANALYSIS / OBSERVATION
    # 1. All the data types are Object in this case,
    # 2. We need to change the data type of each column respective to the meaning of the column
    # 3. Name -> String, Email - String , Phone Number - Int, Visit Date -> Date, Total Bill ->  Float
    # 4.  Payment Method -> String, Rating -> Float and Feedback  ->  string

Name               object
Email              object
Phone Number       object
Visit Date         object
Total Bill        float64
Payment Method     object
Rating            float64
Feedback           object
dtype: object

In [540]:
## Check if there is any duplicate records
df.nunique()
## PRIMARY ANALYSIS / OBSERVATION
    # 1. We have 502 rows but here we are getting only 500 unique rows
    # 2. We might have two duplicate rows in this record, we need to find it and delete the rows if necessary because having entire duplicate row does not make 
    # so much sense

Name              10
Email             10
Phone Number      10
Visit Date         7
Total Bill         6
Payment Method     3
Rating             8
Feedback           4
dtype: int64

### 2. Check Total Duplicate Rows from the record

In [541]:
# duplicated function
# We can check the duplicate records using this method
df.duplicated().head(10)
## PRIMARY ANALYSIS / OBSERVATION
    # 1. Since we have two duplicate rows, we can see from the output that index 7 and index 4 has both duplicate rows
    # 2. We need to observe these duplicate rows careful before dropping it from the record
    # 3. If those are legit duplicate rows that can't make any further conclusion then we can drop those two rows

0    False
1    False
2    False
3    False
4    False
5    False
6    False
7    False
8    False
9    False
dtype: bool

In [542]:
# drop_duplicated() function
# Helps us to drop the duplicate rows
df.drop_duplicates(keep='first',inplace=True)
## PRIMARY ANALYSIS / OBSERVATION
    # 1. We have dropped two duplicate rows, we now have 500 unique rows in the record
    # 2. inplace parameter will make changes on the actual file

df.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6    False
7    False
8    False
9    False
dtype: bool

### 3. Lets drop the columns that are will not contribute us for Analysis

In [543]:
# Before dropping the columns
# lets us nunique function to check the unique value of columns
df.nunique()
## PRIMARY ANALYSIS / OBSERVATION
    # 1. Here Phone number is like unique for all the rows, we are going to drop that column
    # 2. we are also going to drop email,name column from this record,
    # 3. We are deleting those columns for practice purpose, depend upon your analysis nature you should come up with your own decisions for each columns

Name              10
Email             10
Phone Number      10
Visit Date         7
Total Bill         6
Payment Method     3
Rating             8
Feedback           4
dtype: int64

In [544]:
# drop function
# lets drop those columns
# df.drop(columns=['Name','Email','PhoneNumber','Feedback'],errors='raise',inplace=True)
# This should drop all the above columns
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 8 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Name            10 non-null     object
 1   Email           10 non-null     object
 2   Phone Number    10 non-null     object
 3   Visit Date      7 non-null      object
 4   Total Bill      6 non-null      float64
 5   Payment Method  7 non-null      object
 6   Rating          9 non-null      float64
 7   Feedback        4 non-null      object
dtypes: float64(2), object(6)
memory usage: 772.0+ bytes

### 4. Renaming the column

In [545]:
# rename function
# This function helps us rename the column
# we can use the parameter such as inplace=True 
updateColName = {
    'Visit Date':'VisitDate',
    'Total Bill' : 'TotalBill',
    }
df.rename(columns=updateColName,inplace=True)
df.info()
# We can see that the Visit Date columns is renamed to VisitDate

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 8 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Name            10 non-null     object
 1   Email           10 non-null     object
 2   Phone Number    10 non-null     object
 3   VisitDate       7 non-null      object
 4   TotalBill       6 non-null      float64
 5   Payment Method  7 non-null      object
 6   Rating          9 non-null      float64
 7   Feedback        4 non-null      object
dtypes: float64(2), object(6)
memory usage: 772.0+ bytes

### 5. Check the Null / Empty cells

In [546]:
#isnull function
# We can use isnull() function with .sum() to check total number of null values in each column
df.isnull().sum()
## PRIMARY ANALYSIS / OBSERVATION
    # 1. We can see that Name,Email and Phone Number columns dont have any null cells
    # 2. However, We have so many missing values in other columns, Infact some columns are missing almost 50% of the valuesS
df.head(10)

,Name,Email,Phone Number,VisitDate,TotalBill,Payment Method,Rating,Feedback
0,Jessica Mann,susan98@example.com,(738)963-4045x363,2024-06-28,301.87,NaN,NaN,NaN
1,Patricia Mitchell,parkskim@example.net,647-734-0984,NaN,NaN,Credit Card,2.609698,Actually decision remain.
2,Kristin Johnson,christinapalmer@example.com,742.763.2858x79312,2024-01-07,309.56,Cash,3.103861,Outside store tree whole yourself movement war...
3,Grace Johnson,tgay@example.org,(410)363-4499,NaN,273.49,NaN,1.914464,NaN
4,Nicole Fisher,leecolleen@example.net,001-320-849-8236,2024-06-27,493.98,Debit Card,2.011962,NaN
5,Lori Decker,gavingutierrez@example.net,+1-977-610-1845x5807,2024-05-10,NaN,Cash,6.000000,NaN
6,Cynthia Moran,lucas60@example.org,+1-336-569-4706,2024-03-04,NaN,NaN,1.100436,NaN
7,Glenn Williams,nbrown@example.net,812.976.7553,NaN,175.82,Cash,3.868506,Agree whom some road which other despite.
8,Mrs. Samantha Smith,dpierce@example.org,+1-900-907-9624,2024-04-27,NaN,Debit Card,6.000000,Attorney ground claim should.
9,Ashley Gordon DDS,zcruz@example.org,5609295716,2024-07-04,357.96,Debit Card,1.789233,NaN

#### 6. Dropping either Rows / Columns with null/NaN

In [547]:
# Assign the DataFrame to new object
    ## PRIMARY ANALYSIS / OBSERVATION
        # 1. You should be extremely cautious while deleting/ dropping the rows or columns
        # 2. Because deleting either of them without proper understanding the analysis requirement and objective   
        # 3. of the analysis can impact the accuracy and outcome of the Analysis and which will ultimately impact the outcome of decision.

newDrdop = df.dropna(axis='columns',thresh=10,ignore_index=True) #Drop the column depend on the condition
#overriding the default assigned to the newdf array object
newDrdop = df.dropna(axis=0,ignore_index=True,subset=['Feedback'],thresh=1)
newDrdop.head(10)
# Export it to the CSV file format
# newdf.to_csv('row-delete.csv',index=True)

,Name,Email,Phone Number,VisitDate,TotalBill,Payment Method,Rating,Feedback
0,Patricia Mitchell,parkskim@example.net,647-734-0984,NaN,NaN,Credit Card,2.609698,Actually decision remain.
1,Kristin Johnson,christinapalmer@example.com,742.763.2858x79312,2024-01-07,309.56,Cash,3.103861,Outside store tree whole yourself movement war...
2,Glenn Williams,nbrown@example.net,812.976.7553,NaN,175.82,Cash,3.868506,Agree whom some road which other despite.
3,Mrs. Samantha Smith,dpierce@example.org,+1-900-907-9624,2024-04-27,NaN,Debit Card,6.000000,Attorney ground claim should.

### 6. Filling the NaN/ Null Values

In [548]:
# Filling the NaN value with 2024-23-1 for the VisitDate Column
newFill = df.fillna(value = {"VisitDate":'2024-23-1'}) #Fill for specific column
# newdfill = df.interpolate(method='linear')
# newFill = df.fillna('4',limit=3)  #fill for all the columns with NaN
newFill.head(10)

,Name,Email,Phone Number,VisitDate,TotalBill,Payment Method,Rating,Feedback
0,Jessica Mann,susan98@example.com,(738)963-4045x363,2024-06-28,301.87,NaN,NaN,NaN
1,Patricia Mitchell,parkskim@example.net,647-734-0984,2024-23-1,NaN,Credit Card,2.609698,Actually decision remain.
2,Kristin Johnson,christinapalmer@example.com,742.763.2858x79312,2024-01-07,309.56,Cash,3.103861,Outside store tree whole yourself movement war...
3,Grace Johnson,tgay@example.org,(410)363-4499,2024-23-1,273.49,NaN,1.914464,NaN
4,Nicole Fisher,leecolleen@example.net,001-320-849-8236,2024-06-27,493.98,Debit Card,2.011962,NaN
5,Lori Decker,gavingutierrez@example.net,+1-977-610-1845x5807,2024-05-10,NaN,Cash,6.000000,NaN
6,Cynthia Moran,lucas60@example.org,+1-336-569-4706,2024-03-04,NaN,NaN,1.100436,NaN
7,Glenn Williams,nbrown@example.net,812.976.7553,2024-23-1,175.82,Cash,3.868506,Agree whom some road which other despite.
8,Mrs. Samantha Smith,dpierce@example.org,+1-900-907-9624,2024-04-27,NaN,Debit Card,6.000000,Attorney ground claim should.
9,Ashley Gordon DDS,zcruz@example.org,5609295716,2024-07-04,357.96,Debit Card,1.789233,NaN

### 7. Change the DataType  - Datetime -> Numeric

In [549]:
# Usually in DataFrame, all the date / numbers are often imported as Object by default.
# Therefore, we need to convert these two and other columns to right data type

# Check the data type using dtypes method
changeType = df
# Convert Object to Datetime
changeType['VisitDate'].apply(pd.to_datetime)
# changeType.dtypes
changeType.head(4)


# changeType.duplicated()

,Name,Email,Phone Number,VisitDate,TotalBill,Payment Method,Rating,Feedback
0,Jessica Mann,susan98@example.com,(738)963-4045x363,2024-06-28,301.87,NaN,NaN,NaN
1,Patricia Mitchell,parkskim@example.net,647-734-0984,NaN,NaN,Credit Card,2.609698,Actually decision remain.
2,Kristin Johnson,christinapalmer@example.com,742.763.2858x79312,2024-01-07,309.56,Cash,3.103861,Outside store tree whole yourself movement war...
3,Grace Johnson,tgay@example.org,(410)363-4499,NaN,273.49,NaN,1.914464,NaN

### 8. Replacing the Invalid values in Column

In [554]:
#import Numpy package to replace invalid values
import numpy as np
changeType.TotalBill =changeType.TotalBill.replace(to_replace=np.NaN, value=23)
changeType.head(4)
# Replacing NaN in the TotalBill column with 23.00

,Name,Email,Phone Number,VisitDate,TotalBill,Payment Method,Rating,Feedback
0,Jessica Mann,susan98@example.com,(738)963-4045x363,2024-06-28,301.87,NaN,NaN,NaN
1,Patricia Mitchell,parkskim@example.net,647-734-0984,NaN,23.00,Credit Card,2.609698,Actually decision remain.
2,Kristin Johnson,christinapalmer@example.com,742.763.2858x79312,2024-01-07,309.56,Cash,3.103861,Outside store tree whole yourself movement war...
3,Grace Johnson,tgay@example.org,(410)363-4499,NaN,273.49,NaN,1.914464,NaN